##Data Modification

In [28]:
import pandas as pd
data = {
    "Name": [
        "Prince", "Rahul", "Mohit", "Uttam", "Sonu",
        "Monu", "Komal", "Juli", "Ravi", "Pooja",
        "Aman", "Neha", "Arjun", "Kavya", "Rohan",
        "Simran", "Vikas", "Anita", "Deepak", "Meena"
    ],
    "Age": [
        40, 34, 55, 63, 40,
        45, 56, 35, 29, 32,
        41, 27, 36, 31, 44,
        28, 39, 30, 46, 38
    ],
    "Department": [
        "HR", "Finance", "IT", "Operations", "IT",
        "Finance", "HR", "Marketing", "IT", "Finance",
        "Operations", "HR", "Marketing", "IT", "Finance",
        "Operations", "Marketing", "HR", "Finance", "IT"
    ],
    "Salary": [
        12000, 34000, 67000, 78000, 47000,
        78000, 69000, 70000, 45000, 52000,
        60000, 31000, 56000, 48000, 73000,
        42000, 65000, 39000, 72000, 58000
    ],
    "Performance Score": [
        85, 46, 77, 89, 90,
        66, 90, 88, 70, 82,
        79, 60, 91, 72, 68,
        74, 86, 64, 93, 80
    ]
}

df=pd.DataFrame(data)
print(df)

      Name  Age  Department  Salary  Performance Score
0   Prince   40          HR   12000                 85
1    Rahul   34     Finance   34000                 46
2    Mohit   55          IT   67000                 77
3    Uttam   63  Operations   78000                 89
4     Sonu   40          IT   47000                 90
5     Monu   45     Finance   78000                 66
6    Komal   56          HR   69000                 90
7     Juli   35   Marketing   70000                 88
8     Ravi   29          IT   45000                 70
9    Pooja   32     Finance   52000                 82
10    Aman   41  Operations   60000                 79
11    Neha   27          HR   31000                 60
12   Arjun   36   Marketing   56000                 91
13   Kavya   31          IT   48000                 72
14   Rohan   44     Finance   73000                 68
15  Simran   28  Operations   42000                 74
16   Vikas   39   Marketing   65000                 86
17   Anita   30          HR   39000                 64
18  Deepak   46     Finance   72000                 93
19   Meena   38          IT   58000                 80

###to add column

In [29]:
#df["Column name"]= some_data
df["Bonus"] = df["Salary"]*0.1

#method 2 using insert
#df.insert(loc,"Column Name",some_data)
df.insert(0,"Employee ID",[10,20,30,40,50,60,70,80,90,100,110,120,130,140,150,160,170,180,190,200])
print(df)

    Employee ID    Name  Age  Department  Salary  Performance Score   Bonus
0            10  Prince   40          HR   12000                 85  1200.0
1            20   Rahul   34     Finance   34000                 46  3400.0
2            30   Mohit   55          IT   67000                 77  6700.0
3            40   Uttam   63  Operations   78000                 89  7800.0
4            50    Sonu   40          IT   47000                 90  4700.0
5            60    Monu   45     Finance   78000                 66  7800.0
6            70   Komal   56          HR   69000                 90  6900.0
7            80    Juli   35   Marketing   70000                 88  7000.0
8            90    Ravi   29          IT   45000                 70  4500.0
9           100   Pooja   32     Finance   52000                 82  5200.0
10          110    Aman   41  Operations   60000                 79  6000.0
11          120    Neha   27          HR   31000                 60  3100.0
12          130   Arjun   36   Marketing   56000                 91  5600.0
13          140   Kavya   31          IT   48000                 72  4800.0
14          150   Rohan   44     Finance   73000                 68  7300.0
15          160  Simran   28  Operations   42000                 74  4200.0
16          170   Vikas   39   Marketing   65000                 86  6500.0
17          180   Anita   30          HR   39000                 64  3900.0
18          190  Deepak   46     Finance   72000                 93  7200.0
19          200   Meena   38          IT   58000                 80  5800.0

In [30]:
df.insert(7,"Total Salary",df["Salary"]+df["Bonus"])
print(df)

    Employee ID    Name  Age  Department  Salary  Performance Score   Bonus  \
0            10  Prince   40          HR   12000                 85  1200.0
1            20   Rahul   34     Finance   34000                 46  3400.0
2            30   Mohit   55          IT   67000                 77  6700.0
3            40   Uttam   63  Operations   78000                 89  7800.0
4            50    Sonu   40          IT   47000                 90  4700.0
5            60    Monu   45     Finance   78000                 66  7800.0
6            70   Komal   56          HR   69000                 90  6900.0
7            80    Juli   35   Marketing   70000                 88  7000.0
8            90    Ravi   29          IT   45000                 70  4500.0
9           100   Pooja   32     Finance   52000                 82  5200.0
10          110    Aman   41  Operations   60000                 79  6000.0
11          120    Neha   27          HR   31000                 60  3100.0
12          130   Arjun   36   Marketing   56000                 91  5600.0
13          140   Kavya   31          IT   48000                 72  4800.0
14          150   Rohan   44     Finance   73000                 68  7300.0
15          160  Simran   28  Operations   42000                 74  4200.0
16          170   Vikas   39   Marketing   65000                 86  6500.0
17          180   Anita   30          HR   39000                 64  3900.0
18          190  Deepak   46     Finance   72000                 93  7200.0
19          200   Meena   38          IT   58000                 80  5800.0

    Total Salary
0        13200.0
1        37400.0
2        73700.0
3        85800.0
4        51700.0
5        85800.0
6        75900.0
7        77000.0
8        49500.0
9        57200.0
10       66000.0
11       34100.0
12       61600.0
13       52800.0
14       80300.0
15       46200.0
16       71500.0
17       42900.0
18       79200.0
19       63800.0

In [33]:
##Update a column
#df["Column Name"]= some_data
# df.loc[row_index,"column Name"] = new_value
df.loc[0,'Salary']=df.loc[0,"Salary"]+5000
#udating multiple rows
df["Salary"]=df["Salary"]*1.05
print(df)

    Employee ID    Name  Age  Department   Salary  Performance Score   Bonus  \
0            10  Prince   40          HR  23100.0                 85  1200.0
1            20   Rahul   34     Finance  35700.0                 46  3400.0
2            30   Mohit   55          IT  70350.0                 77  6700.0
3            40   Uttam   63  Operations  81900.0                 89  7800.0
4            50    Sonu   40          IT  49350.0                 90  4700.0
5            60    Monu   45     Finance  81900.0                 66  7800.0
6            70   Komal   56          HR  72450.0                 90  6900.0
7            80    Juli   35   Marketing  73500.0                 88  7000.0
8            90    Ravi   29          IT  47250.0                 70  4500.0
9           100   Pooja   32     Finance  54600.0                 82  5200.0
10          110    Aman   41  Operations  63000.0                 79  6000.0
11          120    Neha   27          HR  32550.0                 60  3100.0
12          130   Arjun   36   Marketing  58800.0                 91  5600.0
13          140   Kavya   31          IT  50400.0                 72  4800.0
14          150   Rohan   44     Finance  76650.0                 68  7300.0
15          160  Simran   28  Operations  44100.0                 74  4200.0
16          170   Vikas   39   Marketing  68250.0                 86  6500.0
17          180   Anita   30          HR  40950.0                 64  3900.0
18          190  Deepak   46     Finance  75600.0                 93  7200.0
19          200   Meena   38          IT  60900.0                 80  5800.0

    Total Salary
0        13200.0
1        37400.0
2        73700.0
3        85800.0
4        51700.0
5        85800.0
6        75900.0
7        77000.0
8        49500.0
9        57200.0
10       66000.0
11       34100.0
12       61600.0
13       52800.0
14       80300.0
15       46200.0
16       71500.0
17       42900.0
18       79200.0
19       63800.0

##removing Column

In [ ]:
#df.drop(columns=["Column name","colummn 2"],inplace = True)
df.drop(columns=["Total Salary"],inplace=True)
print(df)

    Employee ID    Name  Age  Department   Salary  Performance Score   Bonus
0            10  Prince   40          HR  23100.0                 85  1200.0
1            20   Rahul   34     Finance  35700.0                 46  3400.0
2            30   Mohit   55          IT  70350.0                 77  6700.0
3            40   Uttam   63  Operations  81900.0                 89  7800.0
4            50    Sonu   40          IT  49350.0                 90  4700.0
5            60    Monu   45     Finance  81900.0                 66  7800.0
6            70   Komal   56          HR  72450.0                 90  6900.0
7            80    Juli   35   Marketing  73500.0                 88  7000.0
8            90    Ravi   29          IT  47250.0                 70  4500.0
9           100   Pooja   32     Finance  54600.0                 82  5200.0
10          110    Aman   41  Operations  63000.0                 79  6000.0
11          120    Neha   27          HR  32550.0                 60  3100.0
12          130   Arjun   36   Marketing  58800.0                 91  5600.0
13          140   Kavya   31          IT  50400.0                 72  4800.0
14          150   Rohan   44     Finance  76650.0                 68  7300.0
15          160  Simran   28  Operations  44100.0                 74  4200.0
16          170   Vikas   39   Marketing  68250.0                 86  6500.0
17          180   Anita   30          HR  40950.0                 64  3900.0
18          190  Deepak   46     Finance  75600.0                 93  7200.0
19          200   Meena   38          IT  60900.0                 80  5800.0